app/views/comments/_comment.html.erb

INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "Test action cable"], ["rating", 3], ["product_id", 1], ["created_at", 2016-10-02 09:26:56 UTC], ["updated_at", 2016-10-02 09:26:56 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
			<p>
			    <%= comment.user.first_name %> <small><em><%= "#{time_ago_in_words(comment.created_at)} ago" %></em></small>