app/controllers/comments_controller.rb

	def create
		@product = Product.find(params[:product_id])
		@comment = @product.comments.new(comment_params)
		@comment.user = current_user
		@user = current_user
		respond_to do |format|
			if @comment.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "This is a test"], ["rating", 3], ["product_id", 1], ["user_id", 1], ["created_at", "2016-08-17 17:50:55.357575"], ["updated_at", "2016-08-17 17:50:55.357575"]]

	def destroy
	  @comment = Comment.find(params[:id])
	  product = @comment.product
	  @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 45]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 45]]