app/controllers/payments_controller.rb

	def create
	  @product = Product.find(params[:product_id])
	  user = current_user
	  token = params[:stripeToken]
	  # Create the charge on Stripe's servers - this will charge the user's card
	  begin
	    charge = Stripe::Charge.create(
	      :amount => (@product.price).to_i*100, # amount in cents, again
	      :currency => "eur",
	      :source => token,
	      :description => params[:stripeEmail]
	    )
	    if @current_user == nil
	    	flash[:alert] = "You need to be sign in to create an order. Your credit card was not charged."
      		redirect_to product_path(@product)

	   elsif charge.paid
	   		Order.create(
	   			:product_id => @product_id,
          		:user_id => @current_user.id,
          		:total => @product.price)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("user_id", "total") VALUES (?, ?)  [["user_id", 1], ["total", 1.0]]