app/controllers/products_controller.rb

  def index
    if params[:q]
      search_term = params[:q]
      # return our filtered list here
      @products = Product.where("name LIKE ?","%#{search_term}%")
    else
      @products = Product.all
---
SELECT "products".* FROM "products" WHERE (name LIKE '%product2%')
SELECT "products".* FROM "products"
SELECT MAX("products"."updated_at") FROM "products"

  def show
    @comments = @product.comments.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 5 OFFSET 0  [["product_id", 1]]
SELECT AVG(ratings) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Product1"], ["description", "My First Product"], ["image_url", "bmx.jpg"], ["created_at", "2016-06-16 07:33:18.133728"], ["updated_at", "2016-06-16 07:33:18.133728"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "https://i5.walmartimages.com/asr/207609ec-6439-4a1b-9c98-81ad52d29f1e_1.3d2902a4b4a78d6cd9b0f851cc2d0ad2.jpeg"], ["updated_at", "2016-09-18 20:23:34.679799"], ["id", 2]]