app/controllers/static_pages_controller.rb

SELECT  "products".* FROM "products" LIMIT 3
---
  def landing_page
  	@products = Product.limit(3)