app/views/products/_comments.html.erb

<%if @product.comments.blank? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC  [["product_id", 1]]

	<% @comments.each do |c| %>
		 <p><%= c.user.first_name %> <small><em><%= "#{time_ago_in_words(c.created_at)} ago" %></em></small></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]